//#include <stdio.h>
//
//int main()
//{
//	printf("%d\n", 10);         //%d 정수값 
//    printf("%lf\n", 3.4);       //%lf 실수값	
//	printf("%.1lf\n", 3.45);	//%.1lf 실수 1자리수까지 표시 
//	printf("%.10lf\n", 3.4);    //%.10lf 실수 10자리까지 표시 
//	                            // n 은 ,뒤에있는 값을 입력 \는 문단 나누기 
//	
//	
//	printf("%d과 %d의 합은 %d입니다.\n", 10, 20, 10 + 20);  //%d 는 문장 뒷값 을ㄹ 가져옴 비여있으면 더미데이터 입려됨 
//	printf("%.1lf - %.1lf = %.1lf\n", 3.4, 1.2, 3.4 - 1.2); //실수값 표시후 연산자 사용하여 연산  
//	
//	
//	return 0;
//}
